app/views/page_produit/show.html.erb

        <ul>
          <% (@produit.stock.other_image).each do |image| %>
---
SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 10 LIMIT 1