app/controllers/administration/produit_autorises_controller.rb

SELECT `produit_autorises`.* FROM `produit_autorises` WHERE `produit_autorises`.`id` = 0 LIMIT 1
---
  def show
  	@produit_autorise = ProduitAutorise.find(params[:id])