app/controllers/administration/produit_vente_libres_controller.rb

  def index
    #TO DEFINE THE PAGE WHERE I AM
    @admin_produit = true

  	@produit_vente_libres = ProduitVenteLibre.where(:user_id => params[:user_id])
  	authorize! :update, User.find(params[:user_id])
---
SELECT `produit_vente_libres`.* FROM `produit_vente_libres` WHERE `produit_vente_libres`.`user_id` = 7
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1

  def edit
  @produit_vente_libre = ProduitVenteLibre.find(params[:id])
---
SELECT `produit_vente_libres`.* FROM `produit_vente_libres` WHERE `produit_vente_libres`.`id` = 1 LIMIT 1