app/controllers/administration/stocks_controller.rb

SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`user_id` = 7
---
  def index
  	@stocks = Stock.where(:user_id => params[:user_id])