app/controllers/administration/stocks_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
---
  def index
  	#TO DEFINE THE PAGE WHERE I AM
  	@admin_produit = true

  	@stocks = Stock.where(:user_id => params[:user_id]).order('created_at DESC')
  	@stock_new = Stock.new
   	authorize! :update, User.find(params[:user_id]) #TRADUCTION : EST-IL AUTORISE A UPDATER CETTE UTILISATEUR ?

SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 4 LIMIT 1
SELECT `unite_mesures`.* FROM `unite_mesures` WHERE `unite_mesures`.`id` = 1 LIMIT 1
---
  def show
  	@stock = Stock.find(params[:id])
  	#A ENLEVER
  	@stock.unite_mesure_info = @stock.unite_mesure.nom
  	#____
  	@unite_mesure = UniteMesure.find(@stock.unite_mesure_id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
---
  def new
    @stock = Stock.new
  	authorize! :update, User.find(params[:user_id]) #TRADUCTION : EST-IL AUTORISE A UPDATER CETTE UTILISATEUR ?

SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 4 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
---
  def edit
    @stock = Stock.find(params[:id])
  	authorize! :update, User.find(params[:user_id]) #TRADUCTION : EST-IL AUTORISE A UPDATER CETTE UTILISATEUR ?

SELECT COUNT(*) FROM `stocks` WHERE (produit_autorise_id = 'undefined' AND user_id = 'undefined')
---
  def alreadyExistStock
  	existe_deja = true
  	produit_stock = Stock.where("produit_autorise_id = ? AND user_id = ?",params[:produit_autorise_id], params[:user_id])
  	if produit_stock.count > 0 and params[:produit_autorise_id] != ""

SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 4 LIMIT 1
SELECT `photo_stocks`.* FROM `photo_stocks` WHERE (stock_id = 4 AND first_image = "1")
SELECT COUNT(*) FROM `photo_stocks` WHERE (stock_id = 4 AND first_image = "1")
UPDATE `photo_stocks` SET `first_image` = 0, `updated_at` = '2012-05-18 11:27:44' WHERE `photo_stocks`.`id` = 7
INSERT INTO `photo_stocks` (`created_at`, `first_image`, `image`, `stock_id`, `updated_at`) VALUES ('2012-05-18 10:42:43', 1, 'Capture_d_e_cran_2012-04-20_a__20.14.08.png', 4, '2012-05-18 10:42:43')
---
  def add_image
    @stock = Stock.find(params[:stock_id])
    #____  SI IMAGE MISE EN PLACE IMAGE PAR DEFAUT
	if params[:photo_stock][:first_image] == "1"
		@photo_first_image = PhotoStock.where('stock_id = ? AND first_image = "1"', @stock.id)
		if @photo_first_image.count > 0
			@photo_first_image[0].first_image = 0
			@photo_first_image[0].save
		end
	else
		@photo_first_image = PhotoStock.where('stock_id = ? AND first_image = "1"', @stock.id)
		#__ SI PAS ENCORE DIMAGE PAR DEFAUT, ON L'APPLIQUE __
		if @photo_first_image.count == 0
			params[:photo_stock][:first_image] = "1"
		else
			params[:photo_stock][:first_image] = "0"
		end
	end
	@photo_stock = PhotoStock.new(params[:photo_stock])
	@photo_stock.stock_id = @stock.id
	@photo_stock.save

SELECT `photo_stocks`.* FROM `photo_stocks` WHERE `photo_stocks`.`id` = 13 LIMIT 1
DELETE FROM `photo_stocks` WHERE `photo_stocks`.`id` = 13
---
  def delete_image
  	@image_stock = PhotoStock.find(params[:image_id])
  	@image_stock.remove_image = true
  	@image_stock.destroy