app/controllers/administration/users_controller.rb

	def add_image
	    #____  SI IMAGE MISE EN PLACE IMAGE PAR DEFAUT
		if params[:photo_user][:first_image] == "1"
			@photo_first_image = PhotoUser.where('user_id = ? AND first_image = "1"', current_user.id)
			if @photo_first_image.count > 0
				@photo_first_image[0].first_image = 0
				@photo_first_image[0].save
---
SELECT `photo_users`.* FROM `photo_users` WHERE (user_id = 7 AND first_image = "1")
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT COUNT(*) FROM `photo_users` WHERE (user_id = 7 AND first_image = "1")
UPDATE `photo_users` SET `first_image` = 0, `updated_at` = '2012-05-18 10:22:29' WHERE `photo_users`.`id` = 12

  def update_image
    @image = PhotoUser.find(params[:image_id])
    #____  SI IMAGE MISE EN PLACE IMAGE PAR DEFAUT
	if params[:photo_user][:first_image] == "1"
		#___ SI PAS DE CHANGEMENT ______
		if @image.first_image == 1
			flash[:notice] = "Aucun changement"
		else
			@photo_first_image = PhotoUser.where('user_id = ? AND first_image = "1"', current_user.id)
			if @photo_first_image.count > 0
				@photo_first_image[0].first_image = 0
				@photo_first_image[0].save
---
SELECT `photo_users`.* FROM `photo_users` WHERE `photo_users`.`id` = 16 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `photo_users`.* FROM `photo_users` WHERE (user_id = 7 AND first_image = "1")
SELECT COUNT(*) FROM `photo_users` WHERE (user_id = 7 AND first_image = "1")
UPDATE `photo_users` SET `first_image` = 0, `updated_at` = '2012-05-18 10:35:41' WHERE `photo_users`.`id` = 15