app/views/page_revendeur/show.html.erb


	<% (@revendeur.list_panier_en_vente).each do |panier| %>
---
SELECT `paniers`.* FROM `paniers` WHERE `paniers`.`revendeur_id` = 7