app/views/administration/produit_vente_libres/_edit_form.html.erb

<%= simple_form_for([:administration, User.find(params[:user_id]),@produit_vente_libre], :html => {:class => 'form-horizontal well' }) do |f| %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1