app/controllers/abonnements_controller.rb

SELECT `abonnements`.* FROM `abonnements` WHERE `abonnements`.`id` = 2 LIMIT 1
UPDATE `abonnements` SET `quantite` = 1, `updated_at` = '2012-04-22 08:56:57' WHERE `abonnements`.`id` = 2
---
  def ajouterQuantite
  	#_____ PARAMS ENVOYER ID Abonnement ____
  	@abonnement = Abonnement.find(params[:id_abonnement])
  	@isnt_yours = 0
  	if Abonnement.exists?(@abonnement)

  		#______ VERIF SI CLIENT CONNECTED OR NOT AND SI ABONNEMENT ASSOCIE AU CLIENT OU A LA SESSION ______
  		if current_client.nil?
	  		if @abonnement.session_id != session[:abonnement_id]
	  			flash[:notice] = "Cet abonnement n'est pas a vous"
	  			@isnt_yours = 1
	  		end
	  	else
	  		if @abonnement.client_id != current_client.id
	  			flash[:notice] = "Cet abonnement n'est pas a vous"
	  			@isnt_yours = 1
	  		end
	  	end

  		if @isnt_yours == 0
	  		@abonnement.quantite += 1
	  		if @abonnement.save

SELECT `abonnements`.* FROM `abonnements` WHERE `abonnements`.`id` = 2 LIMIT 1
UPDATE `abonnements` SET `quantite` = 4, `updated_at` = '2012-04-22 10:47:26' WHERE `abonnements`.`id` = 2
---
  def diminuerQuantite
  	#_____ PARAMS ENVOYER ID Abonnement ____
  	@abonnement = Abonnement.find(params[:id_abonnement])
  	@isnt_yours = 0
  	if Abonnement.exists?(@abonnement)

  		#______ VERIF SI CLIENT CONNECTED OR NOT AND SI ABONNEMENT ASSOCIE AU CLIENT OU A LA SESSION ______
  		if current_client.nil?
	  		if @abonnement.session_id != session[:abonnement_id]
	  			flash[:notice] = "Cet abonnement n'est pas a vous"
	  			@isnt_yours = 1
	  		end
	  	else
	  		if @abonnement.client_id != current_client.id
	  			flash[:notice] = "Cet abonnement n'est pas a vous"
	  			@isnt_yours = 1
	  		end
	  	end

  		if @isnt_yours == 0
  			if @abonnement.quantite == 1
  				#___ ON ANNULE LABONNEMENT
  				@abonnement.etat = 'annule'
  				if @abonnement.save

SELECT `abonnements`.* FROM `abonnements` WHERE `abonnements`.`id` = 2 LIMIT 1
UPDATE `abonnements` SET `etat` = 'annule', `updated_at` = '2012-04-22 10:48:25' WHERE `abonnements`.`id` = 2
---
  def suppAbonnement
  	#_____ PARAMS ENVOYER ID Abonnement ____
  	@abonnement = Abonnement.find(params[:id_abonnement])
  	@isnt_yours = 0
  	if Abonnement.exists?(@abonnement)

  		#______ VERIF SI CLIENT CONNECTED OR NOT AND SI ABONNEMENT ASSOCIE AU CLIENT OU A LA SESSION ______
  		if current_client.nil?
	  		if @abonnement.session_id != session[:abonnement_id]
	  			flash[:notice] = "Cet abonnement n'est pas a vous"
	  			@isnt_yours = 1
	  		end
	  	else
	  		if @abonnement.client_id != current_client.id
	  			flash[:notice] = "Cet abonnement n'est pas a vous"
	  			@isnt_yours = 1
	  		end
	  	end

  		if @isnt_yours == 0
  			#__ ON ANNULE LABONNEMENT
	  		@abonnement.etat = 'annule'
	  		if @abonnement.save