app/controllers/cageots_controller.rb

SELECT COUNT(*) FROM `abonnements` WHERE (etat = 'en_cours' AND session_id = NULL)
SELECT `abonnements`.* FROM `abonnements` WHERE `abonnements`.`id` = 1 LIMIT 1
UPDATE `abonnements` SET `etat` = 'annule', `updated_at` = '2012-05-18 14:42:06' WHERE `abonnements`.`id` = 1
SELECT `cageots`.* FROM `cageots` WHERE (etat='en_cours' AND session_id = NULL)
SELECT COUNT(*) FROM `cageots` WHERE (etat='en_cours' AND session_id = NULL)
SELECT `produit_vente_libres`.* FROM `produit_vente_libres` WHERE `produit_vente_libres`.`id` = 21 LIMIT 1
SELECT `rel_cageot_produits`.* FROM `rel_cageot_produits` WHERE (cageot_id = 26 AND produit_vente_libre_id = '21')
SELECT COUNT(*) FROM `rel_cageot_produits` WHERE (cageot_id = 26 AND produit_vente_libre_id = '21')
UPDATE `rel_cageot_produits` SET `nombre_pack` = 2, `updated_at` = '2012-05-18 15:16:30' WHERE `rel_cageot_produits`.`id` = 34
---
	def ajoutProduitCageot
		#2 VARIABLES EN POST => params[:produit_vente_libre][:id] / params[:produit_vente_libre][:nombre_pack]
		#_________________
		#________________ SI CLIENT PAS CONNECTED _____________________
		#__________________
		flash[:notice]= ""
		if current_client.nil?
			#_____ SI ABONNEMENT CHOISI/ EXIST _______
			#_____
			@abonnement_exist = Abonnement.where("etat = 'en_cours' AND session_id = ?", session[:abonnement_id])
			if @abonnement_exist.count > 0
				@abonnement = Abonnement.find(@abonnement_exist[0].id)
				@abonnement.etat = "annule"
				@abonnement.save
				flash[:notice] = "Abonnement existant et supprimer. "
			end

			@cageot = Cageot.where("etat='en_cours' AND session_id = ?", session[:cageot_id])
				#________ SI CAGEOT EXISTE ________________
				if @cageot.count >0
					@produit_to_add = RelCageotProduit.where("cageot_id = ? AND produit_vente_libre_id = ?",@cageot[0].id, params[:produit_vente_libre][:id])
					#________ SI PRODUIT EXISTE DEJA DANS LE CAGEOT _________
					if @produit_to_add.count > 0
						@produit = RelCageotProduit.find(@produit_to_add[0].id)
						@produit.nombre_pack += params[:produit_vente_libre][:nombre_pack].to_i
						if @produit.save

INSERT INTO `rel_cageot_produits` (`cageot_id`, `created_at`, `deleted`, `nombre_pack`, `produit_vente_libre_id`, `updated_at`) VALUES (2, '2012-05-18 14:40:14', NULL, 1, 2, '2012-05-18 14:40:14')
---
							@rel_cageot_produit.produit_vente_libre_id = params[:produit_vente_libre][:id]
							@rel_cageot_produit.nombre_pack = params[:produit_vente_libre][:nombre_pack]

							if @rel_cageot_produit.save

SELECT `rel_cageot_produits`.* FROM `rel_cageot_produits` WHERE `rel_cageot_produits`.`id` = 14 LIMIT 1
SELECT `cageots`.* FROM `cageots` WHERE `cageots`.`id` = 14 LIMIT 1
---
	def ajouterQuantite
		@produit_cageot = RelCageotProduit.find(params[:product_cageot_id])
		@cageot = Cageot.find(@produit_cageot.cageot_id)

SELECT `rel_cageot_produits`.* FROM `rel_cageot_produits` WHERE `rel_cageot_produits`.`id` = 34 LIMIT 1
SELECT `cageots`.* FROM `cageots` WHERE `cageots`.`id` = 26 LIMIT 1
DELETE FROM `rel_cageot_produits` WHERE `rel_cageot_produits`.`id` = 34
---
	def supprimerProduitCageot
		@produit_cageot = RelCageotProduit.find(params[:product_cageot_id])
		@cageot = Cageot.find(@produit_cageot.cageot_id)
		if @cageot.session_id == session[:cageot_id] || @cageot.client_id == current_client.id
			@produit_cageot.destroy