app/controllers/page_produit_controller.rb

SELECT `categories`.* FROM `categories`
SELECT `produit_vente_libres`.* FROM `produit_vente_libres`
---
  def index
  	@all_categorie = Categorie.all
  	@all_agriculteurs = User.where(:entite_id => 2)
  	@titre = "Tous les produits"
  	@produits = ProduitVenteLibre.where('deleted="0"')
  	@produits_first_block = []
  	@produit_middle_block = []
  	@produit_last_block = []

  	#___ SI MOINS DE 5 PRODUIT, QUE LE BLOCK DU MILIEU _____
  	if @produits.count < 5
  		@produit_middle_block = @produits
  	#___ SI 5 PRODUITS, SEULEMENT LE PREMIER BLOCK _________
  	elsif @produits.count == 5
  		@first_huge_product = @produits[0]
  		(1..4).each do |i|
  			@produits_first_block << @produits[i]
  		end
  	#___________ SI PLUS DE 5 PRODUITS _____________________
  	elsif 5 < @produits.count
  		#______ PREMIER BLOCK ___________
  		@first_huge_product = @produits[0]
  		(1..4).each do |i|
  			@produits_first_block << @produits[i]
  		end

  		#_______ SI ON A LE COMPTE PILE POUR AVOIR LE FIRST BLOCK, MIDDLE BLOCK AND LAST BLOCK
  		if (@produits.count - 10) % 4 == 0 && @produits.count - 10 >= 0

SELECT `produit_vente_libres`.* FROM `produit_vente_libres` WHERE `produit_vente_libres`.`id` = 2 LIMIT 1
---
  def show
   @produit = ProduitVenteLibre.find(params[:product_id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
SELECT `categories`.* FROM `categories`
SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`categorie_id` = 1
---
  def index_by_categorie

  	if !params[:categorie_id].kind_of?(Array) && !params[:categorie_id].nil? && params[:categorie_id] != ""
  		begin
  			@categorie = Categorie.find(params[:categorie_id])
  		rescue
  			@categorie = nil
  		end
  	else
  		@categorie = nil
  	end

  	@all_categorie = Categorie.all

	if params[:categorie_id].kind_of?(Array) && (params[:categorie_id].nil? || params[:categorie_id] == "")
  		@titre = "Toutes les  categories"
  		@stocks = Stock.where('deleted="0"')
  	else
  		if @categorie.nil? && !params[:categorie_id].kind_of?(Array)
  			@titre = "Toutes les  categories"
  			@stocks = Stock.where('deleted="0"')
  		else
  			if !params[:categorie_id].kind_of?(Array)
  				@titre = "Produit de la categorie : #{@categorie.nom}"
  			end

  			@stocks = Stock.where('categorie_id = ? AND deleted = "0"', params[:categorie_id])

SELECT `produit_vente_libres`.* FROM `produit_vente_libres` WHERE `produit_vente_libres`.`stock_id` = 4
SELECT COUNT(*) FROM `produit_vente_libres` WHERE `produit_vente_libres`.`stock_id` = 1
---
    #__ SI STOCK A CATEGORIE
    if @stocks.count != 0
    	@stocks.each do |stock|
    		@produit_vente_libre = ProduitVenteLibre.where(:stock_id => stock.id)
    		#__ SI PRODUIT EST EN VENTE LIBRE
    		if @produit_vente_libre.count != 0