app/controllers/page_produit_controller.rb

SELECT COUNT(*) FROM `stocks` WHERE `stocks`.`categorie_id` = 2
---
  def index_by_categorie
  	@categorie = Categorie.find(params[:categorie_id])
  	if @categorie.nil?
  		@titre = "Cette categorie n'existe pas"
  	else

	  	@titre = "Produit de la categorie : #{@categorie.nom}"
	    @stocks = Stock.where(:categorie_id => params[:categorie_id])
	    @produits = []
	    #__ SI STOCK A CATEGORIE
	    if @stocks.count != 0