app/controllers/page_revendeur_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`entite_id` = 2
---
  def index
  	@titre = "Tous les agriculteurs"
  	@revendeurs = User.where(:entite_id => 2) #Le 2 correspond au agrciulteurs

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def show
  	@revendeur = User.find(params[:id])