app/controllers/page_panier_controller.rb

SELECT `categories`.* FROM `categories`
SELECT `paniers`.* FROM `paniers`
---
  def index
  	@all_categorie = Categorie.all
  	@all_agriculteurs = User.where(:entite_id => 2)
  	@titre = "Tous les paniers"
  	@paniers_ = Panier.where('deleted="0"')
  	@paniers_first_block = []
  	@paniers_middle_block = []
  	@paniers_last_block = []


  	@paniers = []
	@paniers_.each do |panier|

SELECT `paniers`.* FROM `paniers` WHERE `paniers`.`id` = 3 LIMIT 1
---
  def show
   @panier = Panier.find(params[:panier_id])