app/controllers/process_order_controller.rb

  def resume

  	if current_client.nil?
  		@abonnement_exist = Abonnement.where('etat = "en_cours" AND session_id = ?', session[:abonnement_id])
  	else
  		@abonnement_exist = Abonnement.where('etat = "en_cours" AND client_id = ?', current_client.id)
  	end
  	@listing_produit = nil
  	@abonnement_panier = nil
  	if @abonnement_exist.count > 0
  		@titre = "Resume abonnement"
  		@abonnement_panier = Abonnement.find(@abonnement_exist[0].id)
  	else
  		@titre = "Resume cageot"
  		if !current_client.nil?
  			@cageot_exist = Cageot.where("etat = 'en_cours' AND client_id = ?", current_client.id)
  		else
  			if !session[:cageot_id].nil?
  				@cageot_exist = Cageot.where("etat = 'en_cours' AND session_id = ?", session[:cageot_id])
  			else
  				@cageot_exist = []
  			end
  		end

  		if @cageot_exist.count > 0
---
SELECT COUNT(*) FROM `abonnements` WHERE (etat = "en_cours" AND session_id = NULL)
SELECT `abonnements`.* FROM `abonnements` WHERE `abonnements`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `cageots` WHERE (etat='en_cours' AND session_id = NULL)

  def confirmation
  	@point_relais = PointRelai.all #__ ACHANGER PEUT ETRE
---
SELECT `point_relais`.* FROM `point_relais`