app/views/administration/stocks/_edit_form.html.erb

    	<%= f.input :description,:input_html => { :rows => "10" } %>
    	<%= f.association :unite_mesure, :collection => UniteMesure.all.map{ |um| [um.nom,um.id]}, :label => "Unite de mesure", :include_blank => false %>
---
SELECT `unite_mesures`.* FROM `unite_mesures`