app/views/administration/stocks/_form.html.erb

    	<%= f.input :id_user_input, :as => :hidden, :input_html => { :value => params[:user_id] } %>
		<%= f.association :produit_autorise,:collection=>ProduitAutorise.where(:user_id => current_user.direction_id).map{|pa| [pa.titre,pa.id]}, :include_blank => false %>
---
SELECT `produit_autorises`.* FROM `produit_autorises` WHERE `produit_autorises`.`user_id` = 5

    	<%= f.input :description,:input_html => { :rows => "10" } %>
    	<%= f.association :unite_mesure, :collection => UniteMesure.all.map{ |um| [um.nom,um.id]}, :label => "Unite de mesure", :include_blank => false %>
---
SELECT `unite_mesures`.* FROM `unite_mesures`