app/views/administration/stocks/show.html.erb

	<ul>
		<% (@stock.photo_stocks).each do |image| %>
---
SELECT `photo_stocks`.* FROM `photo_stocks` WHERE `photo_stocks`.`stock_id` = 4